In [3]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [4]:
ser1=pd.Series([1,2,3,4],['az','or','co','az'])
ser1

az    1
or    2
co    3
az    4
dtype: int64

In [5]:
ser2=pd.Series([1,2,3,4,10],['ca','or','co','az','nv'])
ser2

ser1=pd.Series([1,2,5,8,10],['ca','or','co','az','nv'])
ser1

ca     1
or     2
co     5
az     8
nv    10
dtype: int64

In [6]:
ser1=pd.Series([1,2,5,8,10],['ca','or','co','az','nv'])
ser1

ca     1
or     2
co     5
az     8
nv    10
dtype: int64

In [7]:
mat_dat=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,162')
row_labels=['raj','pandey','srini','sunil','ashok']
column_headings=['age','Height','weight']

In [8]:
#syntax
#df=pd.DataFrame(data=mat_dat,index=row_labels,columns=column_headings)
df=pd.DataFrame(mat_dat,row_labels,column_headings)

In [17]:
df

        age  Height  weight
raj      22      66     140
pandey   42      70     148
srini    30      62     125
sunil    35      68     160
ashok    25      62     162

In [21]:
df["age"]

raj       22
pandey    42
srini     30
sunil     35
ashok     25
Name: age, dtype: int32

In [23]:
#selecting a particular data element
df.loc['pandey','Height']

70

In [25]:
df.loc['pandey','weight']

148

In [11]:
# check thecode and find error reason

df.loc(['srini','pandey']['Height'])

TypeError: list indices must be integers or slices, not str

In [45]:
df2=df[df['weight']>150]
df2

       age  Height  weight
sunil   35      68     160
ashok   25      62     162

In [47]:
#col accesed by Dot method
df2=df[df.weight>150]
df2

       age  Height  weight
sunil   35      68     160
ashok   25      62     162

In [49]:
#slicing the data using loc
df.loc['sunil']

age        35
Height     68
weight    160
Name: sunil, dtype: int32

In [53]:
#slicing the data providing index of row(default is row)
df.iloc[0]

age        22
Height     66
weight    140
Name: raj, dtype: int32

In [54]:
#slicing the data providing index of row and col

df.iloc[0][1]

66

In [58]:
bool1=df.Height>65
bool2=df.weight>145

In [60]:
bool1

raj        True
pandey     True
srini     False
sunil      True
ashok     False
Name: Height, dtype: bool

In [65]:
print(df[bool1][['age','weight']])

        age  weight
raj      22     140
pandey   42     148
sunil    35     160

In [70]:
#adding new col 
df['profession']="stu teach engg grad doc".split( )

In [72]:
df

        age  Height  weight profession
raj      22      66     140        stu
pandey   42      70     148      teach
srini    30      62     125       engg
sunil    35      68     160       grad
ashok    25      62     162        doc

In [73]:
df.set_index('profession')

            age  Height  weight
profession
stu          22      66     140
teach        42      70     148
engg         30      62     125
grad         35      68     160
doc          25      62     162